# Pokemon graph [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg?style=flat-square)](http://makeapullrequest.com)
A Pokémon graph database, baseade in the [Bulbapedia](https://bulbapedia.bulbagarden.net). 

The script of this project was generated by the project [Bulbapedia Scraper](https://github.com/IgorRozani/bulbapedia-scraper).

## Database model
![Diagem](/img/diagram.png)

The database has four nodes labels and four relationships labels:
- Nodes:
    - Type: the Pokémon Type (Ex.: fire, water, grass);
    - Pokemon: the Pokémon data (Ex.: Pikachu, Arceu, Arcanine);
    - MegaEvolution: the mega evolution Pokémon (Ex.: Mega Charizard X, Mega Scizor); 
    - Form: the possible forms from the Pokémon (Ex.: Castform sunny form, Castform rainy form).
- Relationships:
    - Is: the pokemon type relationship with Pokémon (Ex.: Pikachu is Eletric);
    - Evolve: relationship between the pokemon nodes, to represent the evolutions (Ex.: Charmander evolve to Charmeleon);
    - Has: the relationship between the forms and pokémons (Ex.: Deoxys has Attack Forme);
    - Mega_Evolve: to represent the mega evolution of pokemons (Ex.: Absol mega evolve to Mega Absol).

## Examples

### Quantity pokémons per type
```
MATCH (t:Type)-[:IS]-(p:Pokemon)
WITH t, count(p) as qt
RETURN t.name, qt
ORDER BY qt DESC
```

### Quantity pokémons, mega evolução and forms per type
```
MATCH (t:Type)-[:IS]-(p)
WITH t, count(p) as qt
RETURN t.name, qt
ORDER BY qt DESC
```

### List of pokémons with forms
```
MATCH (p:Pokemon)-[:HAS]-(f:Form)
WITH p, count(f) as qt
WHERE qt > 1
RETURN p.name, qt
ORDER BY qt DESC
```

### List of mega evolutions by pokémon
```
MATCH (p:Pokemon)-[:MEGA_EVOLVE]-(m:MegaEvolution)
WITH p, m
ORDER BY p.name
WITH p, collect(m.name) as megaEvolutions
RETURN p.name, megaEvolutions
ORDER BY p.name
```

### List of pokemons with forms or mega evolution
```
MATCH (p:Pokemon)-[:MEGA_EVOLVE|:HAS]-(f)
WITH p, collect(f.name) as formes
RETURN p.name, formes
ORDER BY p.name
```

### Pokémon evolutions and mega evolutions
```
MATCH (p1:Pokemon{name:'Charmander'})-[:EVOLVE|:MEGA_EVOLVE*]->(p2)
WITH p1, collect(p2.name) as names
RETURN DISTINCT p1.name, names
```